def book_list_view(library):
    if not library:
        print(f"В библиотеке нет книг.")
        return

    print("Список книг в библиотеке:\n" + "\n".join(library))


def add_book(library, title, author, year):
    if title in library:
        print(f"Книга '{title}' уже существует в библиотеке.")
        choice = input("Хотите обновить информацию о книге? (да/нет): ").strip().lower()
        if choice == "да":
            library[title] = {"Автор": author, "Год издания": year, "Наличие": None}
            print(f"Информация о книге '{title}' успешно обновлена.\n")
        else:
            print("Информация о книге не изменена.\n")
    else:
        library[title] = {"Автор": author, "Год издания": year, "Наличие": None}
        print(f"Книга '{title}' успешно добавлена в библиотеку.\n")


library = {
    "Грозовой перевал": {
        "Автор": "Эмили Бронте",
        "Год издания": 1847,
        "Наличие": "В наличии"
    },
    "Скорбь Сатаны": {
        "Автор": "Мария Корелли",
        "Год издания": 1895,
        "Наличие": "В наличии"
    },
    "Письма Баламута": {
        "Автор": "Клайв Стейплз Льюис",
        "Год издания": 1942,
        "Наличие": "Нет в наличии"
    },
    "Тихий Дон": {
        "Автор": "Михаил Шолохов",
        "Год издания": 1928,
        "Наличие": "Нет в ниличии"
    },
    "Собор Парижской Богоматери": {
        "Автор": "Викор Гюго",
        "Год издания": 1831,
        "Наличие": "В наличии"
    },
    "Джейн Эйр": {
        "Автор": "Шарлотта Бронте",
        "Год издания": 1847,
        "Наличие": "В наличии"
    },
}

empty_library = {}

add_book(library, "Джейн Эйр", "Шарлотта Бронте", 1847)
add_book(library, "Божественная комедия", "Данте Алигьери", 1472)

book_list_view(library)
book_list_view(empty_library)
